# Taps

# Brews (Packages)
brew "bat"
brew "httpie"
brew "eza"
brew "fzf"
brew "neovim"
brew "lazygit"
brew "n"
brew "ripgrep"
brew "fd"
# brew "php"
brew "php@8.3"
brew "ruby"
tap "shopify/shopify"
brew "shopify-cli"

# Image tools for conversion & optimization
brew "imagemagick"     # powerful image processing CLI (supports many formats incl. AVIF if compiled with support)

# Casks (Applications)
# cask "google-chrome"
# cask "alfred"
# cask "firefox@developer-edition"
# cask "visual-studio-code"
cask "zed"
# cask "tower"
# cask 1password
# cask alfred
cask "wezterm"
cask "ghostty"
cask "dash"
cask "blender"
