# Brews (Packages)
brew "bat"
brew "httpie"
brew "eza"
brew "fzf"
brew "zoxide"
brew "neovim"
brew "lazygit"
brew "n"
brew "ripgrep"
brew "fd"
brew "php@8.3"
brew "ruby"
tap "shopify/shopify"
brew "shopify-cli"
tap "sst/tap"
brew "opencode"

# Image tools for conversion & optimization
brew "imagemagick"     # powerful image processing CLI (supports many formats incl. AVIF if compiled with support)

# Aadditions for fzf-lua media previews

brew "viu"
brew "chafa"
brew "ghostscript"      # provides `gs` – needed to render PDF files
brew "tectonic"         # OR use pdflatex via MacTeX, but tectonic is simpler
brew "wget"
brew "python"
brew "go"
brew "tree-sitter-cli"

# Casks (Applications)
# cask "google-chrome"
# cask "alfred"
cask "firefox@developer-edition"
cask "google-chrome@canary"
# cask "visual-studio-code"
cask "zed"
# cask "tower"
# cask 1password
# cask alfred
cask "ghostty"
cask "kitty"
cask "dash"
cask "blender"
cask "popclip"

# Fonts
cask "font-jetbrains-mono-nerd-font"
