# Brews (Packages)
brew "bat"
brew "httpie"
brew "eza"
brew "fzf"
brew "zoxide"
brew "neovim"
brew "git"
brew "lazygit"
brew "n"
brew "ripgrep"
brew "fd"
brew "tmux"
# brew "task"
# brew "taskwarrior-tui"
brew "php@8.3"
brew "ruby"
brew "python@3.13"
tap "shopify/shopify"
brew "shopify-cli"
brew "fastfetch"

# Image tools for conversion & optimization
brew "imagemagick"     # powerful image processing CLI (supports many formats incl. AVIF if compiled with support)

# Aadditions for fzf-lua media previews

brew "viu"
brew "chafa"
brew "ghostscript"      # provides `gs` – needed to render PDF files
brew "tectonic"         # OR use pdflatex via MacTeX, but tectonic is simpler
brew "wget"
brew "go"
brew "tree-sitter-cli"
brew "gum"

# Add the Charmbracelet repository
tap "charmbracelet/tap"

brew "gh"

# Use the full path to the formula
brew "charmbracelet/tap/crush"
brew "glow"
brew "charmbracelet/tap/wishlist"

# TUI Task Manager
brew "tuxedo"

# TUI TMUX alternative
brew "herdr"

# Casks (Applications)
# cask "google-chrome"
# cask "alfred"
cask "firefox@developer-edition"
cask "google-chrome@canary"
cask "zed"
# cask 1password
cask "ghostty"
cask "dash"
cask "popclip"
cask "pika"
cask "karabiner-elements"
cask "keyclu"

# Fonts
cask "font-jetbrains-mono-nerd-font"

